Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCZAD.svd
        <register>
          <name>_0_GENA</name>
          <description>PWM0 Generator A Control</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>PWM_0_GENA_ACTZERO</name>
              <description>Action for Counter=0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTZERO_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTZERO_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTZERO_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTLOAD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTLOAD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTLOAD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAU_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAU_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAU_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPAD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBU_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBU_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBU_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENA_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBD_INV</name>
                  <description>Invert pwmA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBD_ZERO</name>
                  <description>Drive pwmA Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENA_ACTCMPBD_ONE</name>
                  <description>Drive pwmA High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_GENB</name>
          <description>PWM0 Generator B Control</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>PWM_0_GENB_ACTZERO</name>
              <description>Action for Counter=0</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTZERO_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTZERO_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTZERO_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTZERO_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTLOAD</name>
              <description>Action for Counter=LOAD</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTLOAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTLOAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTLOAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTLOAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTCMPAU</name>
              <description>Action for Comparator A Up</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTCMPAD</name>
              <description>Action for Comparator A Down</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPAD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTCMPBU</name>
              <description>Action for Comparator B Up</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBU_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBU_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBU_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBU_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWM_0_GENB_ACTCMPBD</name>
              <description>Action for Comparator B Down</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBD_NONE</name>
                  <description>Do nothing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBD_INV</name>
                  <description>Invert pwmB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBD_ZERO</name>
                  <description>Drive pwmB Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM_0_GENB_ACTCMPBD_ONE</name>
                  <description>Drive pwmB High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_DBCTL</name>
          <description>PWM0 Dead-Band Control</description>
          <addressOffset>0x00000068</addressOffset>
          <fields>
            <field>
              <name>PWM_0_DBCTL_ENABLE</name>
              <description>Dead-Band Generator Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_DBRISE</name>
          <description>PWM0 Dead-Band Rising-Edge Delay</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>PWM_0_DBRISE_DELAY</name>
              <description>Dead-Band Rise Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_DBFALL</name>
          <description>PWM0 Dead-Band Falling-Edge-Delay</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>PWM_0_DBFALL_DELAY</name>
              <description>Dead-Band Fall Delay</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSRC0</name>
          <description>PWM0 Fault Source 0</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>PWM_0_FLTSRC0_FAULT0</name>
              <description>Fault0 Input</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC0_FAULT1</name>
              <description>Fault1 Input</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC0_FAULT2</name>
              <description>Fault2 Input</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC0_FAULT3</name>
              <description>Fault3 Input</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_FLTSRC1</name>
          <description>PWM0 Fault Source 1</description>
          <addressOffset>0x00000078</addressOffset>
          <fields>
            <field>
              <name>PWM_0_FLTSRC1_DCMP0</name>
              <description>Digital Comparator 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC1_DCMP1</name>
              <description>Digital Comparator 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC1_DCMP2</name>
              <description>Digital Comparator 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC1_DCMP3</name>
              <description>Digital Comparator 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC1_DCMP4</name>
              <description>Digital Comparator 4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC1_DCMP5</name>
              <description>Digital Comparator 5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC1_DCMP6</name>
              <description>Digital Comparator 6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWM_0_FLTSRC1_DCMP7</name>
              <description>Digital Comparator 7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>_0_MINFLTPER</name>
          <description>PWM0 Minimum Fault Period</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>PWM_0_MINFLTPER</name>
              <description>Minimum Fault Period</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
