Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCZAD.svd
        <register>
          <name>HB16CFG4</name>
          <description>EPI Host-Bus 16 Configuration 4</description>
          <addressOffset>0x0000030C</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16CFG4_MODE</name>
              <description>CS3n Host Bus Sub-Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_MODE_ADMUX</name>
                  <description>ADMUX - AD[15:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_MODE_AD</name>
                  <description>ADNONMUX - D[15:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG4_RDWS</name>
              <description>CS3n Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG4_WRWS</name>
              <description>CS3n Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG4_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG4_BURST</name>
              <description>CS3n Burst Mode</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG4_RDCRE</name>
              <description>CS3n PSRAM Configuration Register Read</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG4_WRCRE</name>
              <description>CS3n PSRAM Configuration Register Write</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG4_ALEHIGH</name>
              <description>CS3n ALE Strobe Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG4_RDHIGH</name>
              <description>CS3n READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG4_WRHIGH</name>
              <description>CS3n WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8CFG4</name>
          <description>EPI Host-Bus 8 Configuration 4</description>
          <alternateGroup>EPI_ALT8</alternateGroup>
          <addressOffset>0x0000030C</addressOffset>
          <fields>
            <field>
              <name>EPI_HB8CFG4_MODE</name>
              <description>CS3n Host Bus Sub-Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_MODE_ADMUX</name>
                  <description>ADMUX - AD[7:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_MODE_AD</name>
                  <description>ADNONMUX - D[7:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG4_RDWS</name>
              <description>CS3n Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG4_WRWS</name>
              <description>CS3n Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG4_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG4_ALEHIGH</name>
              <description>CS3n ALE Strobe Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG4_RDHIGH</name>
              <description>CS2n READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG4_WRHIGH</name>
              <description>CS3n WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME</name>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000310</addressOffset>
          <fields>
            <field>
              <name>EPI_HB8TIME_RDWSM</name>
              <description>Read Wait State Minus One</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME_WRWSM</name>
              <description>Write Wait State Minus One</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME_CAPWIDTH</name>
              <description>CS0n Inter-transfer Capture Width</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME_IRDYDLY</name>
              <description>CS0n Input Ready Delay</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME</name>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <alternateGroup>EPI_ALT16</alternateGroup>
          <addressOffset>0x00000310</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16TIME_RDWSM</name>
              <description>Read Wait State Minus One</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME_WRWSM</name>
              <description>Write Wait State Minus One</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME_CAPWIDTH</name>
              <description>CS0n Inter-transfer Capture Width</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME_PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <bitRange>[18:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME_PSRAMSZ_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16TIME_IRDYDLY</name>
              <description>CS0n Input Ready Delay</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME2</name>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <addressOffset>0x00000314</addressOffset>
          <fields>
            <field>
              <name>EPI_HB8TIME2_RDWSM</name>
              <description>CS1n Read Wait State Minus One</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME2_WRWSM</name>
              <description>CS1n Write Wait State Minus One</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME2_CAPWIDTH</name>
              <description>CS1n Inter-transfer Capture Width</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME2_IRDYDLY</name>
              <description>CS1n Input Ready Delay</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME2</name>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <alternateGroup>EPI_ALT16</alternateGroup>
          <addressOffset>0x00000314</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16TIME2_RDWSM</name>
              <description>CS1n Read Wait State Minus One</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME2_WRWSM</name>
              <description>CS1n Write Wait State Minus One</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME2_CAPWIDTH</name>
              <description>CS1n Inter-transfer Capture Width</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME2_PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <bitRange>[18:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME2_PSRAMSZ_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16TIME2_IRDYDLY</name>
              <description>CS1n Input Ready Delay</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16TIME3</name>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x00000318</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16TIME3_RDWSM</name>
              <description>CS2n Read Wait State Minus One</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME3_WRWSM</name>
              <description>CS2n Write Wait State Minus One</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME3_CAPWIDTH</name>
              <description>CS2n Inter-transfer Capture Width</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME3_PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <bitRange>[18:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME3_PSRAMSZ_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16TIME3_IRDYDLY</name>
              <description>CS2n Input Ready Delay</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME3</name>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <alternateGroup>EPI_ALT8</alternateGroup>
          <addressOffset>0x00000318</addressOffset>
          <fields>
            <field>
              <name>EPI_HB8TIME3_RDWSM</name>
              <description>CS2n Read Wait State Minus One</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME3_WRWSM</name>
              <description>CS2n Write Wait State Minus One</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME3_CAPWIDTH</name>
              <description>CS2n Inter-transfer Capture Width</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME3_IRDYDLY</name>
              <description>CS2n Input Ready Delay</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB8TIME4</name>
          <description>EPI Host-Bus 8 Timing Extension</description>
          <alternateGroup>EPI_ALT8</alternateGroup>
          <addressOffset>0x0000031C</addressOffset>
          <fields>
            <field>
              <name>EPI_HB8TIME4_RDWSM</name>
              <description>CS3n Read Wait State Minus One</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME4_WRWSM</name>
              <description>CS3n Write Wait State Minus One</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME4_CAPWIDTH</name>
              <description>CS3n Inter-transfer Capture Width</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EPI_HB8TIME4_IRDYDLY</name>
              <description>CS3n Input Ready Delay</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
