Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCZAD.svd
        <register>
          <name>HB16TIME4</name>
          <description>EPI Host-Bus 16 Timing Extension</description>
          <addressOffset>0x0000031C</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16TIME4_RDWSM</name>
              <description>CS3n Read Wait State Minus One</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME4_WRWSM</name>
              <description>CS3n Write Wait State Minus One</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME4_CAPWIDTH</name>
              <description>CS3n Inter-transfer Capture Width</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>EPI_HB16TIME4_PSRAMSZ</name>
              <description>PSRAM Row Size</description>
              <bitRange>[18:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_0</name>
                  <description>No row size limitation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_128B</name>
                  <description>128 B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_256B</name>
                  <description>256 B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_512B</name>
                  <description>512 B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_1KB</name>
                  <description>1024 B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_2KB</name>
                  <description>2048 B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_4KB</name>
                  <description>4096 B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16TIME4_PSRAMSZ_8KB</name>
                  <description>8192 B</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16TIME4_IRDYDLY</name>
              <description>CS3n Input Ready Delay</description>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HBPSRAM</name>
          <description>EPI Host-Bus PSRAM</description>
          <addressOffset>0x00000360</addressOffset>
          <fields>
            <field>
              <name>EPI_HBPSRAM_CR</name>
              <description>PSRAM Config Register</description>
              <bitRange>[20:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER6</name>
      <prependToName>TIMER6</prependToName>
      <baseAddress>0x400E0000</baseAddress>
      <interrupt><name>TIMER6A</name><value>98</value></interrupt>
      <interrupt><name>TIMER6B</name><value>99</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER0">
      <name>TIMER7</name>
      <prependToName>TIMER7</prependToName>
      <baseAddress>0x400E1000</baseAddress>
      <interrupt><name>TIMER7A</name><value>100</value></interrupt>
      <interrupt><name>TIMER7B</name><value>101</value></interrupt>
    </peripheral>
    <peripheral>
      <name>SYSEXC</name>
      <description>Register map for SYSEXC peripheral</description>
      <groupName>SYSEXC</groupName>
      <prependToName>SYSEXC</prependToName>
      <baseAddress>0x400F9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>SYSEXC</name><value>67</value></interrupt>
      <registers>
        <register>
          <name>RIS</name>
          <description>System Exception Raw Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_RIS_FPIDCRIS</name>
              <description>Floating-Point Input Denormal Exception Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPDZCRIS</name>
              <description>Floating-Point Divide By 0 Exception Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPIOCRIS</name>
              <description>Floating-Point Invalid Operation Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPUFCRIS</name>
              <description>Floating-Point Underflow Exception Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPOFCRIS</name>
              <description>Floating-Point Overflow Exception Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPIXCRIS</name>
              <description>Floating-Point Inexact Exception Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>System Exception Interrupt Mask</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_IM_FPIDCIM</name>
              <description>Floating-Point Input Denormal Exception Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPDZCIM</name>
              <description>Floating-Point Divide By 0 Exception Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPIOCIM</name>
              <description>Floating-Point Invalid Operation Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPUFCIM</name>
              <description>Floating-Point Underflow Exception Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPOFCIM</name>
              <description>Floating-Point Overflow Exception Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPIXCIM</name>
              <description>Floating-Point Inexact Exception Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>System Exception Masked Interrupt Status</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_MIS_FPIDCMIS</name>
              <description>Floating-Point Input Denormal Exception Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPDZCMIS</name>
              <description>Floating-Point Divide By 0 Exception Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPIOCMIS</name>
              <description>Floating-Point Invalid Operation Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPUFCMIS</name>
              <description>Floating-Point Underflow Exception Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPOFCMIS</name>
              <description>Floating-Point Overflow Exception Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPIXCMIS</name>
              <description>Floating-Point Inexact Exception Masked Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <description>System Exception Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSEXC_IC_FPIDCIC</name>
              <description>Floating-Point Input Denormal Exception Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPDZCIC</name>
              <description>Floating-Point Divide By 0 Exception Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPIOCIC</name>
              <description>Floating-Point Invalid Operation Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPUFCIC</name>
              <description>Floating-Point Underflow Exception Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPOFCIC</name>
              <description>Floating-Point Overflow Exception Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPIXCIC</name>
              <description>Floating-Point Inexact Exception Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
