Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCZAD.svd
        <register>
          <name>DCGCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000818</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCUART_D0</name>
              <description>UART Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D1</name>
              <description>UART Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D2</name>
              <description>UART Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D3</name>
              <description>UART Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D4</name>
              <description>UART Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D5</name>
              <description>UART Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D6</name>
              <description>UART Module 6 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCUART_D7</name>
              <description>UART Module 7 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCSSI</name>
          <description>Synchronous Serial Interface Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000081C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCSSI_D0</name>
              <description>SSI Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D1</name>
              <description>SSI Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D2</name>
              <description>SSI Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCSSI_D3</name>
              <description>SSI Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCI2C</name>
          <description>Inter-Integrated Circuit Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000820</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCI2C_D0</name>
              <description>I2C Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D1</name>
              <description>I2C Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D2</name>
              <description>I2C Module 2 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D3</name>
              <description>I2C Module 3 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D4</name>
              <description>I2C Module 4 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D5</name>
              <description>I2C Module 5 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D6</name>
              <description>I2C Module 6 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D7</name>
              <description>I2C Module 7 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D8</name>
              <description>I2C Module 8 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCI2C_D9</name>
              <description>I2C Module 9 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCUSB</name>
          <description>Universal Serial Bus Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000828</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCUSB_D0</name>
              <description>USB Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCCAN</name>
          <description>Controller Area Network Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000834</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCCAN_D0</name>
              <description>CAN Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCCAN_D1</name>
              <description>CAN Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCADC</name>
          <description>Analog-to-Digital Converter Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000838</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCADC_D0</name>
              <description>ADC Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DCGCADC_D1</name>
              <description>ADC Module 1 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCACMP</name>
          <description>Analog Comparator Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x0000083C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCACMP_D0</name>
              <description>Analog Comparator Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCPWM</name>
          <description>Pulse Width Modulator Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000840</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCPWM_D0</name>
              <description>PWM Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCQEI</name>
          <description>Quadrature Encoder Interface Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000844</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCQEI_D0</name>
              <description>QEI Module 0 Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCEEPROM</name>
          <description>EEPROM Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000858</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCEEPROM_D0</name>
              <description>EEPROM Module Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGCCCM</name>
          <description>CRC and Cryptographic Modules Deep-Sleep Mode Clock Gating Control</description>
          <addressOffset>0x00000874</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DCGCCCM_D0</name>
              <description>CRC and Cryptographic Modules Deep-Sleep Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCWD</name>
          <description>Watchdog Timer Power Control</description>
          <addressOffset>0x00000900</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCWD_P0</name>
              <description>Watchdog Timer 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCWD_P1</name>
              <description>Watchdog Timer 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCTIMER</name>
          <description>16/32-Bit General-Purpose Timer Power Control</description>
          <addressOffset>0x00000904</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCTIMER_P0</name>
              <description>General-Purpose Timer 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P1</name>
              <description>General-Purpose Timer 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P2</name>
              <description>General-Purpose Timer 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P3</name>
              <description>General-Purpose Timer 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P4</name>
              <description>General-Purpose Timer 4 Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P5</name>
              <description>General-Purpose Timer 5 Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P6</name>
              <description>General-Purpose Timer 6 Power Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCTIMER_P7</name>
              <description>General-Purpose Timer 7 Power Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCGPIO</name>
          <description>General-Purpose Input/Output Power Control</description>
          <addressOffset>0x00000908</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCGPIO_P0</name>
              <description>GPIO Port A Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P1</name>
              <description>GPIO Port B Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P2</name>
              <description>GPIO Port C Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P3</name>
              <description>GPIO Port D Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P4</name>
              <description>GPIO Port E Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P5</name>
              <description>GPIO Port F Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P6</name>
              <description>GPIO Port G Power Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P7</name>
              <description>GPIO Port H Power Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P8</name>
              <description>GPIO Port J Power Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P9</name>
              <description>GPIO Port K Power Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P10</name>
              <description>GPIO Port L Power Control</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P11</name>
              <description>GPIO Port M Power Control</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P12</name>
              <description>GPIO Port N Power Control</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P13</name>
              <description>GPIO Port P Power Control</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P14</name>
              <description>GPIO Port Q Power Control</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P15</name>
              <description>GPIO Port R Power Control</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P16</name>
              <description>GPIO Port S Power Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCGPIO_P17</name>
              <description>GPIO Port T Power Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDMA</name>
          <description>Micro Direct Memory Access Power Control</description>
          <addressOffset>0x0000090C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCDMA_P0</name>
              <description>uDMA Module Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCEPI</name>
          <description>External Peripheral Interface Power Control</description>
          <addressOffset>0x00000910</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCEPI_P0</name>
              <description>EPI Module Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCHIB</name>
          <description>Hibernation Power Control</description>
          <addressOffset>0x00000914</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCHIB_P0</name>
              <description>Hibernation Module Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Power Control</description>
          <addressOffset>0x00000918</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCUART_P0</name>
              <description>UART Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P1</name>
              <description>UART Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P2</name>
              <description>UART Module 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P3</name>
              <description>UART Module 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P4</name>
              <description>UART Module 4 Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P5</name>
              <description>UART Module 5 Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P6</name>
              <description>UART Module 6 Power Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P7</name>
              <description>UART Module 7 Power Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSSI</name>
          <description>Synchronous Serial Interface Power Control</description>
          <addressOffset>0x0000091C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCSSI_P0</name>
              <description>SSI Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P1</name>
              <description>SSI Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P2</name>
              <description>SSI Module 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P3</name>
              <description>SSI Module 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCI2C</name>
          <description>Inter-Integrated Circuit Power Control</description>
          <addressOffset>0x00000920</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCI2C_P0</name>
              <description>I2C Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P1</name>
              <description>I2C Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P2</name>
              <description>I2C Module 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P3</name>
              <description>I2C Module 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P4</name>
              <description>I2C Module 4 Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P5</name>
              <description>I2C Module 5 Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P6</name>
              <description>I2C Module 6 Power Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P7</name>
              <description>I2C Module 7 Power Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P8</name>
              <description>I2C Module 8 Power Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P9</name>
              <description>I2C Module 9 Power Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCUSB</name>
          <description>Universal Serial Bus Power Control</description>
          <addressOffset>0x00000928</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCUSB_P0</name>
              <description>USB Module Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCCAN</name>
          <description>Controller Area Network Power Control</description>
          <addressOffset>0x00000934</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCCAN_P0</name>
              <description>CAN Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCCAN_P1</name>
              <description>CAN Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
