Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129CNCZAD.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UDMA</name>
      <description>Register map for UDMA peripheral</description>
      <groupName>UDM</groupName>
      <prependToName>UDMA</prependToName>
      <baseAddress>0x400FF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>UDMA</name><value>44</value></interrupt>
      <interrupt><name>UDMAERR</name><value>45</value></interrupt>
      <registers>
        <register>
          <name>STAT</name>
          <description>DMA Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>UDMA_STAT_MASTEN</name>
              <description>Master Enable Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDMA_STAT_STATE</name>
              <description>Control State Machine Status</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_IDLE</name>
                  <description>Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_RD_CTRL</name>
                  <description>Reading channel controller data</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_RD_SRCENDP</name>
                  <description>Reading source end pointer</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_RD_DSTENDP</name>
                  <description>Reading destination end pointer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_RD_SRCDAT</name>
                  <description>Reading source data</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_WR_DSTDAT</name>
                  <description>Writing destination data</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_WAIT</name>
                  <description>Waiting for uDMA request to clear</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_WR_CTRL</name>
                  <description>Writing channel controller data</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_STALL</name>
                  <description>Stalled</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_DONE</name>
                  <description>Done</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_STAT_STATE_UNDEF</name>
                  <description>Undefined</description>
                  <value>0xa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UDMA_STAT_DMACHANS</name>
              <description>Available uDMA Channels Minus 1</description>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>DMA Configuration</description>
          <addressOffset>0x00000004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UDMA_CFG_MASTEN</name>
              <description>Controller Master Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTLBASE</name>
          <description>DMA Channel Control Base Pointer</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>UDMA_CTLBASE_ADDR</name>
              <description>Channel Control Base Address</description>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTBASE</name>
          <description>DMA Alternate Channel Control Base Pointer</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>UDMA_ALTBASE_ADDR</name>
              <description>Alternate Channel Address Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WAITSTAT</name>
          <description>DMA Channel Wait-on-Request Status</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>UDMA_WAITSTAT_WAITREQ</name>
              <description>Channel [n] Wait Status</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREQ</name>
          <description>DMA Channel Software Request</description>
          <addressOffset>0x00000014</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UDMA_SWREQ</name>
              <description>Channel [n] Software Request</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USEBURSTSET</name>
          <description>DMA Channel Useburst Set</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>UDMA_USEBURSTSET_SET</name>
              <description>Channel [n] Useburst Set</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USEBURSTCLR</name>
          <description>DMA Channel Useburst Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UDMA_USEBURSTCLR_CLR</name>
              <description>Channel [n] Useburst Clear</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REQMASKSET</name>
          <description>DMA Channel Request Mask Set</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>UDMA_REQMASKSET_SET</name>
              <description>Channel [n] Request Mask Set</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REQMASKCLR</name>
          <description>DMA Channel Request Mask Clear</description>
          <addressOffset>0x00000024</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UDMA_REQMASKCLR_CLR</name>
              <description>Channel [n] Request Mask Clear</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENASET</name>
          <description>DMA Channel Enable Set</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>UDMA_ENASET_SET</name>
              <description>Channel [n] Enable Set</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ENACLR</name>
          <description>DMA Channel Enable Clear</description>
          <addressOffset>0x0000002C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UDMA_ENACLR_CLR</name>
              <description>Clear Channel [n] Enable Clear</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTSET</name>
          <description>DMA Channel Primary Alternate Set</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>UDMA_ALTSET_SET</name>
              <description>Channel [n] Alternate Set</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTCLR</name>
          <description>DMA Channel Primary Alternate Clear</description>
          <addressOffset>0x00000034</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UDMA_ALTCLR_CLR</name>
              <description>Channel [n] Alternate Clear</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIOSET</name>
          <description>DMA Channel Priority Set</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>UDMA_PRIOSET_SET</name>
              <description>Channel [n] Priority Set</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIOCLR</name>
          <description>DMA Channel Priority Clear</description>
          <addressOffset>0x0000003C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>UDMA_PRIOCLR_CLR</name>
              <description>Channel [n] Priority Clear</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERRCLR</name>
          <description>DMA Bus Error Clear</description>
          <addressOffset>0x0000004C</addressOffset>
          <fields>
            <field>
              <name>UDMA_ERRCLR_ERRCLR</name>
              <description>uDMA Bus Error Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHASGN</name>
          <description>DMA Channel Assignment</description>
          <addressOffset>0x00000500</addressOffset>
          <fields>
            <field>
              <name>UDMA_CHASGN</name>
              <description>Channel [n] Assignment Select</description>
              <bitRange>[31:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UDMA_CHASGN_PRIMARY</name>
                  <description>Use the primary channel assignment</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UDMA_CHASGN_SECONDARY</name>
                  <description>Use the secondary channel assignment</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP0</name>
          <description>DMA Channel Map Select 0</description>
          <addressOffset>0x00000510</addressOffset>
          <fields>
            <field>
              <name>UDMA_CHMAP0_CH0SEL</name>
              <description>uDMA Channel 0 Source Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP0_CH1SEL</name>
              <description>uDMA Channel 1 Source Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP0_CH2SEL</name>
              <description>uDMA Channel 2 Source Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP0_CH3SEL</name>
              <description>uDMA Channel 3 Source Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP0_CH4SEL</name>
              <description>uDMA Channel 4 Source Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP0_CH5SEL</name>
              <description>uDMA Channel 5 Source Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP0_CH6SEL</name>
              <description>uDMA Channel 6 Source Select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP0_CH7SEL</name>
              <description>uDMA Channel 7 Source Select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP1</name>
          <description>DMA Channel Map Select 1</description>
          <addressOffset>0x00000514</addressOffset>
          <fields>
            <field>
              <name>UDMA_CHMAP1_CH8SEL</name>
              <description>uDMA Channel 8 Source Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP1_CH9SEL</name>
              <description>uDMA Channel 9 Source Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP1_CH10SEL</name>
              <description>uDMA Channel 10 Source Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP1_CH11SEL</name>
              <description>uDMA Channel 11 Source Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP1_CH12SEL</name>
              <description>uDMA Channel 12 Source Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP1_CH13SEL</name>
              <description>uDMA Channel 13 Source Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP1_CH14SEL</name>
              <description>uDMA Channel 14 Source Select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP1_CH15SEL</name>
              <description>uDMA Channel 15 Source Select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP2</name>
          <description>DMA Channel Map Select 2</description>
          <addressOffset>0x00000518</addressOffset>
          <fields>
            <field>
              <name>UDMA_CHMAP2_CH16SEL</name>
              <description>uDMA Channel 16 Source Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP2_CH17SEL</name>
              <description>uDMA Channel 17 Source Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP2_CH18SEL</name>
              <description>uDMA Channel 18 Source Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP2_CH19SEL</name>
              <description>uDMA Channel 19 Source Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP2_CH20SEL</name>
              <description>uDMA Channel 20 Source Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP2_CH21SEL</name>
              <description>uDMA Channel 21 Source Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP2_CH22SEL</name>
              <description>uDMA Channel 22 Source Select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP2_CH23SEL</name>
              <description>uDMA Channel 23 Source Select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHMAP3</name>
          <description>DMA Channel Map Select 3</description>
          <addressOffset>0x0000051C</addressOffset>
          <fields>
            <field>
              <name>UDMA_CHMAP3_CH24SEL</name>
              <description>uDMA Channel 24 Source Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH25SEL</name>
              <description>uDMA Channel 25 Source Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH26SEL</name>
              <description>uDMA Channel 26 Source Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH27SEL</name>
              <description>uDMA Channel 27 Source Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH28SEL</name>
              <description>uDMA Channel 28 Source Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH29SEL</name>
              <description>uDMA Channel 29 Source Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH30SEL</name>
              <description>uDMA Channel 30 Source Select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH31SEL</name>
              <description>uDMA Channel 31 Source Select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
